sdaiIsSDAIKindOfBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines whether a specified SDAI data type is a kind of a specified type.
\param instance   [in] An application instance that represents the SDAI data type to be checked.
\param entityName [in] A string that contains the type name.
\returns sdaiTRUE if the specified SDAI data type is a kind of the specified type; otherwise, the function returns false.
\remarks
This function is not implemented yet.